Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties
Serialization structure for AnalysisModelSeismicProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties._NumberOfSeismicParameters
The number of seismic parameters.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties._SeismicParameters
The seismic parameters.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties._SeismicIncludeSelfWeightMass
This indicates whether the selfweight was is included.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties._NumberOfSeismicMassLoadGroupIds
The number of seismic parameters of the mass load groups.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties._SeismicMassLoadGroupIds
The identifier of the mass load groups.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties._NumberOfSeismicMassLoadGroupFactors
The number of factors of the mass load group.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties._SeismicMassLoadGroupFactors
The factors of the mass load group.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties.ToStruct(Tekla.Structures.Analysis.AnalysisModelSeismicProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties.FromStruct(Tekla.Structures.Analysis.AnalysisModelSeismicProperties)
DO NOT USE! For internal usage only!
P: P.